<?php

/*
|--------------------------------------------------------------------------
| 配置文件
|--------------------------------------------------------------------------
| 定义应用配置信息
|
*/
return [
	/**
	 * 应用时区
	 */
	'time_zone'	=> 'PRC',

	/**
	 * 日志
	 */
	'log'		=> [
		'maxSize'      	=> 20480000,
		'logPath'      	=> ROOT_PATH . '/storage/log',
		'rollNum'      	=> 3,
		'logName'      	=> '',
	],

	/**
	 * 数据库配置
	 */
	'database'  => file_exists(__DIR__ . '/database.php') ? require(__DIR__ . '/database.php') : [],
];
